Catalogs/ИА_ВопросыПроверочногоСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВопросыПроверочногоСписка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_ПроверочныйСписок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантныйОтвет</Name>
					<Comment>Простой/Вариантный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Балл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_ВопросыПроверочногоСписка/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("Владелец") Тогда 
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли; 
	ВидимостьОтветов();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьОтветов()
	
	Если Объект.ВариантныйОтвет Тогда
		Элементы.Группа3.Видимость      = Истина;
		Элементы.ОтветВопроса.Видимость = Ложь;
		Элементы.БаллВопроса.Видимость  = Ложь;
		Объект.ОтветВопроса             = 0;
	Иначе
		Элементы.Группа3.Видимость      = Ложь;
		Элементы.ОтветВопроса.Видимость = Истина;
		Элементы.БаллВопроса.Видимость  = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВопросаПриИзменении(Элемент)
	
	ВидимостьОтветов();	
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантыОтветовПриАктивизацииЯчейки(Элемент)
	
	ТекущийЭлемент = Элемент.ТекущийЭлемент;
	Если ТекущийЭлемент.Имя = "ВариантыОтветовОтвет" Тогда
		ТекущиеДанные = Элементы.ВариантыОтветов.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Или ТекущиеДанные.Ответ = Неопределено Тогда
			ТекущийЭлемент.ВыбиратьТип = Истина;
		Иначе
			ТекущийЭлемент.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОтвет(Команда)
	тд = Элементы.ВариантыОтветов.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		Новстр = Объект.ВариантыОтветов.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, тд);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если СтрДлина(Объект.Вопрос)>150 Тогда
		Объект.Наименование = лев(Объект.Вопрос,150);
	Иначе
		Объект.Наименование = Объект.Вопрос;
	КонецЕсли;
КонецПроцедуры
